{"meta":{"title":"The Hornery","subtitle":null,"description":"Where Brenton Horne stores his thoughts and guides relating to technology.","author":"Brenton Horne","url":"http://fusion809.github.io/hexo-site"},"pages":[],"posts":[{"title":"Free Operating Systems: A Comparison and Overview","slug":"free-operating-systems","date":"2016-04-18T22:21:49.838Z","updated":"2016-04-18T22:21:49.838Z","comments":true,"path":"2016/04/19/free-operating-systems/","link":"","permalink":"http://fusion809.github.io/hexo-site/hexo-site/2016/04/19/free-operating-systems/","excerpt":"","keywords":null,"text":"In modern times it seems like everyday we encounter some type of computer in our day-to-day lives. Many people think that a computer is either a desktop or laptop, but this is untrue, as smartphones and tablets are also computers. Smartphones and tablets are examples of mobile devices (MDs), while desktop and laptop computers (and variants thereof, like workstations and notebooks, respectively) are so called personal computers (PCs). Before I proceed any further it is important that I clear up some basic terminology. The physical components of MDs and PCs, such as the Central Processing Unit (CPU), Hard Disk Drive (HDD), Random-Access Memory (RAM) devices, Wi-Fi chips (which are especially common in laptops and mobile devices) and graphics cards, are referred to as the computer’s hardware. While the data contained on the computer’s HDD, including the various programs that users use to interact with the computer, is referred to as software. Both MDs and PCs have installed on them a very basic, yet also very important piece of software known as an operating system (OS).","raw":null,"content":null,"categories":[],"tags":[]},{"title":"Free Operating Systems: A Comparison and Overview","slug":"free-operating-systems","date":"2016-04-18T19:14:01.127Z","updated":"2016-04-18T19:14:01.127Z","comments":true,"path":"2016/04/19/free-operating-systems/","link":"","permalink":"http://fusion809.github.io/hexo-site/hexo-site/2016/04/19/free-operating-systems/","excerpt":"","keywords":null,"text":"In modern times it seems like everyday we encounter some type of computer in our day-to-day lives. Many people think that a computer is either a desktop or laptop, but this is untrue, as smartphones and tablets are also computers. Smartphones and tablets are examples of mobile devices, while desktop and laptop computers (and variants thereof, like workstations and notebooks, respectively) are so called personal computers (PCs).","raw":null,"content":null,"categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2016-04-09T10:03:14.614Z","updated":"2016-04-09T10:03:14.614Z","comments":true,"path":"2016/04/09/hello-world/","link":"","permalink":"http://fusion809.github.io/hexo-site/hexo-site/2016/04/09/hello-world/","excerpt":"","keywords":null,"text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","raw":null,"content":null,"categories":[],"tags":[]}]}